In [1]:
import pandas as pd

In [2]:
pd

In [3]:
bd_weather = {
    "City": ["dhaka", "cumilla","rajshahi"] ,
    "temperature" : [32,45,30] ,
    "humidity" : [80,60,78]
}

In [4]:
bd_weather

{'City': ['dhaka', 'cumilla', 'rajshahi'],
 'temperature': [32, 45, 30],
 'humidity': [80, 60, 78]}

In [5]:
bd = pd.DataFrame(bd_weather)

In [6]:
bd

       City  temperature  humidity
0     dhaka           32        80
1   cumilla           45        60
2  rajshahi           30        78

In [7]:
ind_weather = {
    "City": ["mumbai", "delhi","banglore"] ,
    "temperature" : [22,32,30] ,
    "humidity" : [90,70,80]
}

In [8]:
ind = pd.DataFrame(ind_weather)

In [9]:
ind

       City  temperature  humidity
0    mumbai           22        90
1     delhi           32        70
2  banglore           30        80

In [10]:
ind

       City  temperature  humidity
0    mumbai           22        90
1     delhi           32        70
2  banglore           30        80

In [13]:
df = pd.concat([bd,ind])

In [14]:
df

       City  temperature  humidity
0     dhaka           32        80
1   cumilla           45        60
2  rajshahi           30        78
0    mumbai           22        90
1     delhi           32        70
2  banglore           30        80

In [25]:
df = pd.concat([bd,ind] , ignore_index=True)  # fetting a continuoes index

In [26]:
df

                  City  temperature  humidity
bangladesh 0     dhaka           32        80
           1   cumilla           45        60
           2  rajshahi           30        78
usa        0    mumbai           22        90
           1     delhi           32        70
           2  banglore           30        80

In [27]:
df = pd.concat([bd,ind] , keys=["Bangladesh","Usa"] )  # fetting a continuoes index

In [29]:
df

                  City  temperature  humidity
Bangladesh 0     dhaka           32        80
           1   cumilla           45        60
           2  rajshahi           30        78
Usa        0    mumbai           22        90
           1     delhi           32        70
           2  banglore           30        80

In [32]:
df.loc['Usa']

       City  temperature  humidity
0    mumbai           22        90
1     delhi           32        70
2  banglore           30        80

In [34]:
 tem_df= pd.DataFrame({
     "City": ["dhaka", "cumilla","rajshahi"] ,
    "temperature" : [32,45,30] ,
 })

In [35]:
tem_df

       City  temperature
0     dhaka           32
1   cumilla           45
2  rajshahi           30

In [44]:
wind_df = pd.DataFrame({
    "City": ["cumilla", "dhaka","rajshahi"] ,
    "windspeed" : [35,85,90] ,
} , index =[0,1,2])

In [45]:
wind_df

       City  windspeed
0   cumilla         35
1     dhaka         85
2  rajshahi         90

In [46]:
pd.concat([tem_df,wind_df] ,axis =1 )

       City  temperature      City  windspeed
0     dhaka           32   cumilla         35
1   cumilla           45     dhaka         85
2  rajshahi           30  rajshahi         90

In [47]:
 s = pd.Series(["Humid","Dry","Rain"] , name ="event")

In [48]:
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [56]:
tem_df = pd.concat([tem_df,s],axis =1)

In [57]:
tem_df

       City  temperature  event  event  event  event
0     dhaka         32.0    NaN  Humid  Humid  Humid
1   cumilla         45.0    NaN    Dry    Dry    Dry
2  rajshahi         30.0    NaN   Rain   Rain   Rain
0       NaN          NaN  Humid  Humid  Humid  Humid
1       NaN          NaN    Dry    Dry    Dry    Dry
2       NaN          NaN   Rain   Rain   Rain   Rain

In [ ]:
r